; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v5 ?v10)
             (pred_7 ?v13 ?v2)
             (pred_9 ?v5 ?v2)
             (pred_10 ?v11 ?v5 )
	     (pred_12 ?v5)
             (pred_6 ?v9)
             (pred_2 ?v13)
             (pred_11 ?v2)
             (pred_4 ?v5)
             (pred_1 ?v13)
             (pred_8 ?v5)
             (pred_3 ))



(:action op_4
:parameters (?v3 ?v7 ?v1 ?v6)
:precondition (and (pred_6 ?v3) (pred_6 ?v7) (pred_2 ?v1) (pred_11 ?v6)
          (pred_5 ?v3 ?v7) (pred_7 ?v1 ?v6)
                   (pred_9 ?v7 ?v6) (pred_12 ?v3) 
                   (pred_4 ?v7) (pred_1 ?v1))
:effect (and  (pred_8 ?v7) (not (pred_4 ?v7))))


(:action op_5
:parameters (?v3 ?v8)
:precondition (and (pred_6 ?v3) (pred_6 ?v8)
               (pred_12 ?v3) (pred_5 ?v3 ?v8) (pred_8 ?v8))
:effect (and (pred_12 ?v8) (not (pred_12 ?v3))))

(:action op_3
:parameters (?v3 ?v1)
:precondition (and (pred_6 ?v3) (pred_2 ?v1) 
                  (pred_12 ?v3) (pred_10 ?v1 ?v3) (pred_3 ))
:effect (and (pred_1 ?v1)
   (not (pred_10 ?v1 ?v3)) (not (pred_3 ))))


(:action op_2
:parameters (?v3 ?v4 ?v12)
:precondition (and (pred_6 ?v3) (pred_2 ?v4) (pred_2 ?v12)
                  (pred_12 ?v3) (pred_1 ?v12) (pred_10 ?v4 ?v3))
:effect (and (pred_1 ?v4) (pred_10 ?v12 ?v3)
        (not (pred_1 ?v12)) (not (pred_10 ?v4 ?v3))))

(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_6 ?v3) (pred_2 ?v1) 
                  (pred_12 ?v3) (pred_1 ?v1))
:effect (and (pred_3 ) (pred_10 ?v1 ?v3) (not (pred_1 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_15 obj_03 obj_05 obj_09 obj_20 obj_18 obj_06 obj_11 obj_17 obj_12 obj_01 obj_08 obj_07 obj_14 obj_13
    obj_22 obj_10 obj_21
    obj_19 obj_02 obj_16
    )

    (:init
       (pred_3)

       (pred_6 obj_04)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_05)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_6 obj_18)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_12)
       (pred_6 obj_01)
       (pred_6 obj_08)
       (pred_6 obj_07)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_11 obj_22)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_2 obj_19)
       (pred_2 obj_02)
       (pred_2 obj_16)

       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_15)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_15 obj_03)
       (pred_5 obj_15 obj_04)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_03 obj_05)
       (pred_5 obj_03 obj_15)
       (pred_5 obj_05 obj_06)
       (pred_5 obj_05 obj_03)
       (pred_5 obj_09 obj_11)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_18)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_18 obj_20)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_06 obj_05)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_11 obj_08)
       (pred_5 obj_11 obj_17)
       (pred_5 obj_11 obj_09)
       (pred_5 obj_17 obj_07)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_17 obj_11)
       (pred_5 obj_12 obj_14)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_08 obj_11)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_07 obj_17)
       (pred_5 obj_07 obj_08)
       (pred_5 obj_14 obj_13)
       (pred_5 obj_14 obj_12)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_13 obj_01)
       (pred_5 obj_13 obj_14)
       (pred_4 obj_08)
       (pred_4 obj_14)
       (pred_4 obj_04)
       (pred_9  obj_08 obj_22)
       (pred_9  obj_14 obj_10)
       (pred_9  obj_04 obj_21)
       (pred_8 obj_15)
       (pred_8 obj_03)
       (pred_8 obj_05)
       (pred_8 obj_09)
       (pred_8 obj_20)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_8 obj_11)
       (pred_8 obj_17)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_07)
       (pred_8 obj_13)

       (pred_7  obj_19 obj_22)
       (pred_7  obj_02 obj_10)
       (pred_7  obj_16 obj_21)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_16 obj_01)
       (pred_12 obj_17)
    )

    (:goal (and
       (pred_10 obj_02 obj_13)
    ))
(:constraints
  (always (not (pred_12 obj_12)))
)
)

; plan
1. (op_5 obj_17 obj_20)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_20)
   goals met: 0 of 1
2. (op_5 obj_20 obj_18)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_18)
   goals met: 0 of 1
3. (op_5 obj_18 obj_03)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_03)
   goals met: 0 of 1
4. (op_3 obj_03 obj_02)
   deleted: (pred_10 obj_02 obj_03) (pred_3)
   added: (pred_1 obj_02)
   goals met: 0 of 1
5. (op_5 obj_03 obj_05)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_06)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_06)
   goals met: 0 of 1
7. (op_5 obj_06 obj_01)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_01)
   goals met: 0 of 1
8. (op_5 obj_01 obj_13)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_13)
   goals met: 0 of 1
9. (op_1 obj_13 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_3) (pred_10 obj_02 obj_13)
   goals met: 1 of 1
